
from sympy import factorint
from Crypto.Util.number import long_to_bytes

c = 717608817902276639011922897702552744324264244069272484013719744328086856277690292
n = 1368992139315019955067447961537607041364451719382349005056752379702694554965203011
e = 65537


p, q = 2074606527507983503944226222695401999839, 659880377875535146491994798968813949893149

print("3. Вычисляю секретный ключ...", flush=True)
phi = (p - 1) * (q - 1)
d = pow(e, -1, phi)

print("4. Расшифровываю...", flush=True)
m = pow(c, d, n)

print("5. Результат:", long_to_bytes(m))

res = 'n}2517ca3a_do0g_0n_N_11ams{ymedaca'
print(res[-1:1:-1])
